const fs = require('fs');


let str = `22260\t22260\t9\t1\tCJSH_Monster_touxiang_11_8\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t三头凶蛟图鉴激活：全攻击+500全防御+550\t1\t三头凶蛟图鉴激活：全攻击+500全防御+550\t
22261\t22261\t9\t1\tCJSH_Monster_touxiang_11_8\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t三头凶蛟图鉴激活：全攻击+500全防御+550\t1\t三头凶蛟图鉴激活：全攻击+500全防御+550\t
22262\t22262\t9\t1\tHAN2_Ride_touxiang_8_4\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t赤鳞饕餮图鉴激活：全属性+500全防御+550\t1\t赤鳞饕餮图鉴激活：全属性+500全防御+550\t
22263\t22263\t9\t1\tHAN2_Ride_touxiang_8_4\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t赤鳞饕餮图鉴激活：全属性+500全防御+550\t1\t赤鳞饕餮图鉴激活：全属性+500全防御+550\t
22264\t22264\t9\t1\tHAN2_Ride_touxiang_8_8\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t金眼狻猊图鉴激活：全属性+500全防御+550\t1\t金眼狻猊图鉴激活：全属性+500全防御+550\t
22265\t22265\t9\t1\tHAN2_Ride_touxiang_8_8\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t金眼狻猊图鉴激活：全属性+500全防御+550\t1\t金眼狻猊图鉴激活：全属性+500全防御+550\t
22266\t22266\t9\t1\tHAN2_Ride_touxiang_8_6\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t九色毕方图鉴激活：全属性+500全防御+550\t1\t九色毕方图鉴激活：全属性+500全防御+550\t
22267\t22267\t9\t1\tHAN2_Ride_touxiang_8_6\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t九色毕方图鉴激活：全属性+500全防御+550\t1\t九色毕方图鉴激活：全属性+500全防御+550\t
22268\t22268\t9\t1\tHAN2_Ride_touxiang_8_12\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t银脊珠杌图鉴激活：全属性+500全防御+550\t1\t银脊珠杌图鉴激活：全属性+500全防御+550\t
22269\t22269\t9\t1\tHAN2_Ride_touxiang_8_12\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t银脊珠杌图鉴激活：全属性+500全防御+550\t1\t银脊珠杌图鉴激活：全属性+500全防御+550\t
22270\t22270\t9\t1\tHAN2_Ride_touxiang_8_9\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t吞天烛龙图鉴激活：全属性+500全防御+550\t1\t吞天烛龙图鉴激活：全属性+500全防御+550\t
22271\t22271\t9\t1\tHAN2_Ride_touxiang_8_9\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t吞天烛龙图鉴激活：全属性+500全防御+550\t1\t吞天烛龙图鉴激活：全属性+500全防御+550\t
22272\t22272\t9\t1\tHAN2_Monster_touxiang_20_2\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t毛驴图鉴激活：全属性+1000全防御+1550\t1\t毛驴图鉴激活：全属性+1000全防御+1550\t
22273\t22273\t9\t1\tHAN2_Monster_touxiang_20_2\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t毛驴图鉴激活：全属性+1000全防御+1550\t1\t毛驴图鉴激活：全属性+1000全防御+1550\t
22274\t22274\t9\t1\tHAN2_Monster_touxiang_19_6\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t羊驼图鉴激活：全属性+2000全防御+2550\t1\t羊驼图鉴激活：全属性+2000全防御+2550\t
22275\t22275\t9\t1\tHAN2_Monster_touxiang_19_6\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t羊驼图鉴激活：全属性+2000全防御+2550\t1\t羊驼图鉴激活：全属性+2000全防御+2550\t
22276\t22276\t9\t1\tCJSH_Monster_touxiang_15_3\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t赤炎螳螂图鉴激活：全属性+500全防御+550\t1\t赤炎螳螂图鉴激活：全属性+500全防御+550\t
22277\t22277\t9\t1\tCJSH_Monster_touxiang_15_3\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t赤炎螳螂图鉴激活：全属性+500全防御+550\t1\t赤炎螳螂图鉴激活：全属性+500全防御+550\t
22278\t22278\t9\t1\tCJSH_Monster_touxiang_2_7\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t青螭图鉴激活：全属性+1000全防御+1550\t1\t青螭图鉴激活：全属性+1000全防御+1550\t
22279\t22279\t9\t1\tCJSH_Monster_touxiang_2_7\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t青螭图鉴激活：全属性+1000全防御+1550\t1\t青螭图鉴激活：全属性+1000全防御+1550\t
22280\t22280\t9\t1\tHAN2_Ride_touxiang_9_11\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t多彩豆豆虎图鉴激活：全属性+500全防御+550\t1\t多彩豆豆虎图鉴激活：全属性+500全防御+550\t
22281\t22281\t9\t1\tHAN2_Ride_touxiang_9_11\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t多彩豆豆虎图鉴激活：全属性+500全防御+550\t1\t多彩豆豆虎图鉴激活：全属性+500全防御+550\t
\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t
22282\t22282\t9\t1\tHAN2_Ride_touxiang_8_13\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t幽灵狼图鉴激活：全属性+500全防御+550\t1\t幽灵狼图鉴激活：全属性+500全防御+550\t
22283\t22283\t9\t1\tHAN2_Ride_touxiang_8_13\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t幽灵狼图鉴激活：全属性+500全防御+550\t1\t幽灵狼图鉴激活：全属性+500全防御+550\t
22284\t22284\t9\t1\tHAN2_Ride_touxiang_8_15\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t巨齿鳄图鉴激活：全属性+500全防御+550\t1\t巨齿鳄图鉴激活：全属性+500全防御+550\t
22285\t22285\t9\t1\tHAN2_Ride_touxiang_8_15\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t巨齿鳄图鉴激活：全属性+500全防御+550\t1\t巨齿鳄图鉴激活：全属性+500全防御+550\t
22286\t22286\t9\t1\tHAN2_Ride_touxiang_8_14\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t双头恶犬图鉴激活：全属性+500全防御+550\t1\t双头恶犬图鉴激活：全属性+500全防御+550\t
22287\t22287\t9\t1\tHAN2_Ride_touxiang_8_14\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t双头恶犬图鉴激活：全属性+500全防御+550\t1\t双头恶犬图鉴激活：全属性+500全防御+550\t
22288\t22288\t9\t1\tCJSH_Monster_touxiang_16_11\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t雷芒雨工图鉴激活：全属性+2000全防御+2550\t1\t雷芒雨工图鉴激活：全属性+2000全防御+2550\t
22289\t22289\t9\t1\tCJSH_Monster_touxiang_16_11\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t雷芒雨工图鉴激活：全属性+2000全防御+2550\t1\t雷芒雨工图鉴激活：全属性+2000全防御+2550\t
22290\t22290\t9\t1\tCJSH_Monster_touxiang_10_16\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t幽铠魇虎(黄)图鉴激活：全属性+2000全防御+2550\t1\t幽铠魇虎(黄)图鉴激活：全属性+2000全防御+2550\t
22291\t22291\t9\t1\tCJSH_Monster_touxiang_10_16\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t幽铠魇虎(黄)图鉴激活：全属性+2000全防御+2550\t1\t幽铠魇虎(黄)图鉴激活：全属性+2000全防御+2550\t
22292\t22292\t9\t1\tCJSH_Monster_touxiang_9_1\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t幽铠魇虎(白)图鉴激活：全属性+1000全防御+1550\t1\t幽铠魇虎(白)图鉴激活：全属性+1000全防御+1550\t
22293\t22293\t9\t1\tCJSH_Monster_touxiang_9_1\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t幽铠魇虎(白)图鉴激活：全属性+1000全防御+1550\t1\t幽铠魇虎(白)图鉴激活：全属性+1000全防御+1550\t
22294\t22294\t9\t1\tCJSH_Monster_touxiang_10_12\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t幽铠魇虎(黑)图鉴激活：全属性+1000全防御+1550\t1\t幽铠魇虎(黑)图鉴激活：全属性+1000全防御+1550\t
22295\t22295\t9\t1\tCJSH_Monster_touxiang_10_12\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t幽铠魇虎(黑)图鉴激活：全属性+1000全防御+1550\t1\t幽铠魇虎(黑)图鉴激活：全属性+1000全防御+1550\t
22296\t22296\t9\t1\tCJSH_Add_0_15\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t圣诞熊图鉴激活：全属性+1000全防御+1550\t1\t圣诞熊图鉴激活：全属性+1000全防御+1550\t
22297\t22297\t9\t1\tCJSH_Add_0_15\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t圣诞熊图鉴激活：全属性+1000全防御+1550\t1\t圣诞熊图鉴激活：全属性+1000全防御+1550\t
22298\t22298\t9\t1\tHAN2_Ride_touxiang_9_12\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t金鬃狂狮图鉴激活：全属性+2000全防御+2550\t1\t金鬃狂狮图鉴激活：全属性+2000全防御+2550\t
22299\t22299\t9\t1\tHAN2_Ride_touxiang_9_12\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t金鬃狂狮图鉴激活：全属性+2000全防御+2550\t1\t金鬃狂狮图鉴激活：全属性+2000全防御+2550\t
22300\t22300\t9\t1\tHAN2_Pet_touxiang_1_9\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t烈焱战马图鉴激活：全属性+2000全防御+2550\t1\t烈焱战马图鉴激活：全属性+2000全防御+2550\t
22301\t22301\t9\t1\tHAN2_Pet_touxiang_1_9\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t烈焱战马图鉴激活：全属性+2000全防御+2550\t1\t烈焱战马图鉴激活：全属性+2000全防御+2550\t
\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t
22302\t22302\t9\t1\tCJSH_Monster_touxiang_19_6\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t无双赤兔马图鉴激活：全属性+2000韧性+50闪避+50\t1\t无双赤兔马图鉴激活：全属性+2000韧性+50闪避+50\t
22303\t22303\t9\t1\tCJSH_Monster_touxiang_19_6\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t无双赤兔马图鉴激活：全属性+2000韧性+50闪避+50\t1\t无双赤兔马图鉴激活：全属性+2000韧性+50闪避+50\t
22304\t22304\t9\t1\tCJSH_Monster_touxiang_19_7\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t神行绝影马图鉴激活：全属性+500韧性+20闪避+20\t1\t神行绝影马图鉴激活：全属性+500韧性+20闪避+20\t
22305\t22305\t9\t1\tCJSH_Monster_touxiang_19_7\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t神行绝影马图鉴激活：全属性+500韧性+20闪避+20\t1\t神行绝影马图鉴激活：全属性+500韧性+20闪避+20\t
22306\t22306\t9\t1\tCJSH_Monster_touxiang_21_10\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t乔巴图鉴激活：全属性+500韧性+20闪避+20\t1\t乔巴图鉴激活：全属性+500韧性+20闪避+20\t
22307\t22307\t9\t1\tCJSH_Monster_touxiang_21_10\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t乔巴图鉴激活：全属性+500韧性+20闪避+20\t1\t乔巴图鉴激活：全属性+500韧性+20闪避+20\t
22308\t22308\t9\t1\tCJSH_Monster_touxiang_19_11\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t神火啸天兽图鉴激活：全属性+2000韧性+50闪避+50\t1\t神火啸天兽图鉴激活：全属性+2000韧性+50闪避+50\t
22309\t22309\t9\t1\tCJSH_Monster_touxiang_19_11\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t神火啸天兽图鉴激活：全属性+2000韧性+50闪避+50\t1\t神火啸天兽图鉴激活：全属性+2000韧性+50闪避+50\t
22310\t22310\t9\t1\tCJSH_Monster_touxiang_19_8\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t福瑞金象图鉴激活：全属性+2000韧性+50闪避+50\t1\t福瑞金象图鉴激活：全属性+2000韧性+50闪避+50\t
22311\t22311\t9\t1\tCJSH_Monster_touxiang_19_8\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t福瑞金象图鉴激活：全属性+2000韧性+50闪避+50\t1\t福瑞金象图鉴激活：全属性+2000韧性+50闪避+50\t
22312\t22312\t9\t1\tCJSH_Monster_touxiang_19_10\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t机关战马图鉴激活：全属性+500韧性+20闪避+20\t1\t机关战马图鉴激活：全属性+500韧性+20闪避+20\t
22313\t22313\t9\t1\tCJSH_Monster_touxiang_19_10\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t机关战马图鉴激活：全属性+500韧性+20闪避+20\t1\t机关战马图鉴激活：全属性+500韧性+20闪避+20\t
22314\t22314\t9\t1\tCJSH_Monster_touxiang_21_2\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t暗夜魔虎图鉴激活：全属性+2000韧性+50闪避+50\t1\t暗夜魔虎图鉴激活：全属性+2000韧性+50闪避+50\t
22315\t22315\t9\t1\tCJSH_Monster_touxiang_21_2\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t暗夜魔虎图鉴激活：全属性+2000韧性+50闪避+50\t1\t暗夜魔虎图鉴激活：全属性+2000韧性+50闪避+50\t
22316\t22316\t9\t1\tCJSH_Monster_touxiang_21_4\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t碧海蓝晶兽图鉴激活：全属性+500韧性+20闪避+20\t1\t碧海蓝晶兽图鉴激活：全属性+500韧性+20闪避+20\t
22317\t22317\t9\t1\tCJSH_Monster_touxiang_21_4\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t碧海蓝晶兽图鉴激活：全属性+500韧性+20闪避+20\t1\t碧海蓝晶兽图鉴激活：全属性+500韧性+20闪避+20\t
22318\t22318\t9\t1\tCJSH_Monster_touxiang_19_5\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t绝世的卢战马图鉴激活：全属性+500韧性+20闪避+20\t1\t绝世的卢战马图鉴激活：全属性+500韧性+20闪避+20\t
22319\t22319\t9\t1\tCJSH_Monster_touxiang_19_5\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t绝世的卢战马图鉴激活：全属性+500韧性+20闪避+20\t1\t绝世的卢战马图鉴激活：全属性+500韧性+20闪避+20\t
22320\t22320\t9\t1\tCJSH_Monster_touxiang_21_3\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t金光纵地兽图鉴激活：全属性+500韧性+20闪避+20\t1\t金光纵地兽图鉴激活：全属性+500韧性+20闪避+20\t
22321\t22321\t9\t1\tCJSH_Monster_touxiang_21_3\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t金光纵地兽图鉴激活：全属性+500韧性+20闪避+20\t1\t金光纵地兽图鉴激活：全属性+500韧性+20闪避+20\t
\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t
22322\t22322\t9\t1\tHAN2_Ride_touxiang_10_2\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t地狱魔龙图鉴激活：全属性+2000韧性+50闪避+50\t1\t地狱魔龙图鉴激活：全属性+2000韧性+50闪避+50\t
22323\t22323\t9\t1\tHAN2_Ride_touxiang_10_2\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t地狱魔龙图鉴激活：全属性+2000韧性+50闪避+50\t1\t地狱魔龙图鉴激活：全属性+2000韧性+50闪避+50\t
22324\t22324\t9\t1\tCJSH_Monster_touxiang_19_4\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t星月天虎图鉴激活：全属性+500韧性+40闪避+40\t1\t星月天虎图鉴激活：全属性+500韧性+40闪避+40\t
22325\t22325\t9\t1\tCJSH_Monster_touxiang_19_4\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t星月天虎图鉴激活：全属性+500韧性+40闪避+40\t1\t星月天虎图鉴激活：全属性+500韧性+40闪避+40\t
22326\t22326\t9\t1\tCJSH_Monster_touxiang_20_16\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t至尊魔龙图鉴激活：全属性+2000韧性+50闪避+50\t1\t至尊魔龙图鉴激活：全属性+2000韧性+50闪避+50\t
22327\t22327\t9\t1\tCJSH_Monster_touxiang_20_16\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t至尊魔龙图鉴激活：全属性+2000韧性+50闪避+50\t1\t至尊魔龙图鉴激活：全属性+2000韧性+50闪避+50\t
22328\t22328\t9\t1\tCJSH_Ma_touxiang_3_3\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你四不像图鉴激活：全属性+2000韧性+50闪避+50\t1\t迷你四不像图鉴激活：全属性+2000韧性+50闪避+50\t
22329\t22329\t9\t1\tCJSH_Ma_touxiang_3_3\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你四不像图鉴激活：全属性+2000韧性+50闪避+50\t1\t迷你四不像图鉴激活：全属性+2000韧性+50闪避+50\t
22330\t22330\t9\t1\tCJSH_Monster_touxiang_17_7\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你火麒麟图鉴激活：全属性+2000韧性+50闪避+50\t1\t迷你火麒麟图鉴激活：全属性+2000韧性+50闪避+50\t
22331\t22331\t9\t1\tCJSH_Monster_touxiang_17_7\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你火麒麟图鉴激活：全属性+2000韧性+50闪避+50\t1\t迷你火麒麟图鉴激活：全属性+2000韧性+50闪避+50\t
22332\t22332\t9\t1\tHAN2_Pet_touxiang_1_12\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你布老虎图鉴激活：全属性+2000韧性+50闪避+50\t1\t迷你布老虎图鉴激活：全属性+2000韧性+50闪避+50\t
22333\t22333\t9\t1\tHAN2_Pet_touxiang_1_12\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你布老虎图鉴激活：全属性+2000韧性+50闪避+50\t1\t迷你布老虎图鉴激活：全属性+2000韧性+50闪避+50\t
22334\t22334\t9\t1\tHAN2_Ride_touxiang_8_13\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你幽灵狼图鉴激活：全属性+500韧性+40闪避+40\t1\t迷你幽灵狼图鉴激活：全属性+500韧性+40闪避+40\t
22335\t22335\t9\t1\tHAN2_Ride_touxiang_8_13\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你幽灵狼图鉴激活：全属性+500韧性+40闪避+40\t1\t迷你幽灵狼图鉴激活：全属性+500韧性+40闪避+40\t
22336\t22336\t9\t1\tHAN2_Ride_touxiang_8_15\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你巨齿鳄图鉴激活：全属性+500韧性+40闪避+40\t1\t迷你巨齿鳄图鉴激活：全属性+500韧性+40闪避+40\t
22337\t22337\t9\t1\tHAN2_Ride_touxiang_8_15\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你巨齿鳄图鉴激活：全属性+500韧性+40闪避+40\t1\t迷你巨齿鳄图鉴激活：全属性+500韧性+40闪避+40\t
22338\t22338\t9\t1\tHAN2_Ride_touxiang_8_14\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你双头恶犬图鉴激活：全属性+500韧性+40闪避+40\t1\t迷你双头恶犬图鉴激活：全属性+500韧性+40闪避+40\t
22339\t22339\t9\t1\tHAN2_Ride_touxiang_8_14\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你双头恶犬图鉴激活：全属性+500韧性+40闪避+40\t1\t迷你双头恶犬图鉴激活：全属性+500韧性+40闪避+40\t
22340\t22340\t9\t1\tHAN2_Monster_touxiang_3_15\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你冰魄冥虎图鉴激活：全属性+2000韧性+50闪避+50\t1\t迷你冰魄冥虎图鉴激活：全属性+2000韧性+50闪避+50\t
22341\t22341\t9\t1\tHAN2_Monster_touxiang_3_15\t\t\t人物身体前置点\t\t\t人物头部绑定点\t1\t0\t0\t0\t\t\t\t\t\t迷你冰魄冥虎图鉴激活：全属性+2000韧性+50闪避+50\t1\t迷你冰魄冥虎图鉴激活：全属性+2000韧性+50闪避+50\t
\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t
22342\t22342\t9\t1\tHAN2_Pet_touxiang_1_12\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t布老虎图鉴激活：全属性+500全攻击+500\t1\t布老虎图鉴激活：全属性+500全攻击+500\t
22343\t22343\t9\t1\tHAN2_Pet_touxiang_1_12\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t布老虎图鉴激活：全属性+500全攻击+500\t1\t布老虎图鉴激活：全属性+500全攻击+500\t
22344\t22344\t9\t1\tCJSH_Monster_touxiang_17_1\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t淘气的泡泡鱼图鉴激活：全属性+2000全攻击+2550\t1\t淘气的泡泡鱼图鉴激活：全属性+2000全攻击+2550\t
22345\t22345\t9\t1\tCJSH_Monster_touxiang_17_1\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t淘气的泡泡鱼图鉴激活：全属性+2000全攻击+2550\t1\t淘气的泡泡鱼图鉴激活：全属性+2000全攻击+2550\t
22346\t22346\t9\t1\tCJSH_Monster_touxiang_17_4\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t潘达图鉴激活：全属性+500全攻击+500\t1\t潘达图鉴激活：全属性+500全攻击+500\t
22347\t22347\t9\t1\tCJSH_Monster_touxiang_17_4\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t潘达图鉴激活：全属性+500全攻击+500\t1\t潘达图鉴激活：全属性+500全攻击+500\t
22348\t22348\t9\t1\tCJSH_Monster_touxiang_17_6\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t大角图鉴激活：全属性+1000全攻击+1550\t1\t大角图鉴激活：全属性+1000全攻击+1550\t
22349\t22349\t9\t1\tCJSH_Monster_touxiang_17_6\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t大角图鉴激活：全属性+1000全攻击+1550\t1\t大角图鉴激活：全属性+1000全攻击+1550\t
22350\t22350\t9\t1\tCJSH_Monster_touxiang_17_7\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t炽焰火麟图鉴激活：全属性+500全攻击+500\t1\t炽焰火麟图鉴激活：全属性+500全攻击+500\t
22351\t22351\t9\t1\tCJSH_Monster_touxiang_17_7\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t炽焰火麟图鉴激活：全属性+500全攻击+500\t1\t炽焰火麟图鉴激活：全属性+500全攻击+500\t
22352\t22352\t9\t1\tCJSH_Monster_touxiang_10_12\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t剑齿魔虎图鉴激活：全属性+1000全攻击+1550\t1\t剑齿魔虎图鉴激活：全属性+1000全攻击+1550\t
22353\t22353\t9\t1\tCJSH_Monster_touxiang_10_12\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t剑齿魔虎图鉴激活：全属性+1000全攻击+1550\t1\t剑齿魔虎图鉴激活：全属性+1000全攻击+1550\t
22354\t22354\t9\t1\tCJSH_Monster_touxiang_17_3\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t生命源龙图鉴激活：全属性+500全攻击+500\t1\t生命源龙图鉴激活：全属性+500全攻击+500\t
22355\t22355\t9\t1\tCJSH_Monster_touxiang_17_3\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t生命源龙图鉴激活：全属性+500全攻击+500\t1\t生命源龙图鉴激活：全属性+500全攻击+500\t
22356\t22356\t9\t1\tCJSH_Monster_touxiang_16_13\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t机械鸟图鉴激活：全属性+500全攻击+500\t1\t机械鸟图鉴激活：全属性+500全攻击+500\t
22357\t22357\t9\t1\tCJSH_Monster_touxiang_16_13\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t机械鸟图鉴激活：全属性+500全攻击+500\t1\t机械鸟图鉴激活：全属性+500全攻击+500\t
22358\t22358\t9\t1\tHAN2_Pet_touxiang_1_10\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t寒霜图鉴激活：全属性+2000全攻击+2550\t1\t寒霜图鉴激活：全属性+2000全攻击+2550\t
22359\t22359\t9\t1\tHAN2_Pet_touxiang_1_10\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t寒霜图鉴激活：全属性+2000全攻击+2550\t1\t寒霜图鉴激活：全属性+2000全攻击+2550\t
22360\t22360\t9\t1\tCJSH_Monster_touxiang_17_6\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t圣诞麋鹿图鉴激活：全属性+2000全攻击+2550\t1\t圣诞麋鹿图鉴激活：全属性+2000全攻击+2550\t
22361\t22361\t9\t1\tCJSH_Monster_touxiang_17_6\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t圣诞麋鹿图鉴激活：全属性+2000全攻击+2550\t1\t圣诞麋鹿图鉴激活：全属性+2000全攻击+2550\t
\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t
22362\t22362\t9\t1\tHAN2_Ride_touxiang_3_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t王者麒麟蓝图鉴激活：全属性+1000全攻击+1550\t1\t王者麒麟蓝图鉴激活：全属性+1000全攻击+1550\t
22363\t22363\t9\t1\tHAN2_Ride_touxiang_3_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t王者麒麟蓝图鉴激活：全属性+1000全攻击+1550\t1\t王者麒麟蓝图鉴激活：全属性+1000全攻击+1550\t
22364\t22364\t9\t1\tHAN2_Pet_touxiang_1_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t九命狸猫图鉴激活：全属性+500全攻击+500\t1\t九命狸猫图鉴激活：全属性+500全攻击+500\t
22365\t22365\t9\t1\tHAN2_Pet_touxiang_1_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t九命狸猫图鉴激活：全属性+500全攻击+500\t1\t九命狸猫图鉴激活：全属性+500全攻击+500\t
22366\t22366\t9\t1\tHAN2_Pet_touxiang_1_3\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t七彩陆行鸟图鉴激活：全属性+500全攻击+500\t1\t七彩陆行鸟图鉴激活：全属性+500全攻击+500\t
22367\t22367\t9\t1\tHAN2_Pet_touxiang_1_3\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t七彩陆行鸟图鉴激活：全属性+500全攻击+500\t1\t七彩陆行鸟图鉴激活：全属性+500全攻击+500\t
22368\t22368\t9\t1\tCJSH_Ma_touxiang_3_3\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t四不像图鉴激活：全属性+2000全攻击+2550\t1\t四不像图鉴激活：全属性+2000全攻击+2550\t
22369\t22369\t9\t1\tCJSH_Ma_touxiang_3_3\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t四不像图鉴激活：全属性+2000全攻击+2550\t1\t四不像图鉴激活：全属性+2000全攻击+2550\t
22370\t22370\t9\t1\tCJSH_Monster_touxiang_21_12\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t咆哮战狼图鉴激活：全属性+500全攻击+500\t1\t咆哮战狼图鉴激活：全属性+500全攻击+500\t
22371\t22371\t9\t1\tCJSH_Monster_touxiang_21_12\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t咆哮战狼图鉴激活：全属性+500全攻击+500\t1\t咆哮战狼图鉴激活：全属性+500全攻击+500\t
22372\t22372\t9\t1\tCJSH_Monster_touxiang_18_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t地煞灭魂机甲图鉴激活：全属性+500全攻击+500\t1\t地煞灭魂机甲图鉴激活：全属性+500全攻击+500\t
22373\t22373\t9\t1\tCJSH_Monster_touxiang_18_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t地煞灭魂机甲图鉴激活：全属性+500全攻击+500\t1\t地煞灭魂机甲图鉴激活：全属性+500全攻击+500\t
22374\t22374\t9\t1\tCJSH_Monster_touxiang_18_12\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t天擎金刚机甲图鉴激活：全属性+500全攻击+500\t1\t天擎金刚机甲图鉴激活：全属性+500全攻击+500\t
22375\t22375\t9\t1\tCJSH_Monster_touxiang_18_12\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t天擎金刚机甲图鉴激活：全属性+500全攻击+500\t1\t天擎金刚机甲图鉴激活：全属性+500全攻击+500\t
22376\t22376\t9\t1\tCJSH_Ma_touxiang_3_5\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t炫彩疾风鸟图鉴激活：全属性+2000全攻击+2550\t1\t炫彩疾风鸟图鉴激活：全属性+2000全攻击+2550\t
22377\t22377\t9\t1\tCJSH_Ma_touxiang_3_5\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t炫彩疾风鸟图鉴激活：全属性+2000全攻击+2550\t1\t炫彩疾风鸟图鉴激活：全属性+2000全攻击+2550\t
22378\t22378\t9\t1\tCJSH_Monster_touxiang_17_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t玉兔图鉴激活：全属性+1000全攻击+1550\t1\t玉兔图鉴激活：全属性+1000全攻击+1550\t
22379\t22379\t9\t1\tCJSH_Monster_touxiang_17_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t玉兔图鉴激活：全属性+1000全攻击+1550\t1\t玉兔图鉴激活：全属性+1000全攻击+1550\t
22380\t22380\t9\t1\tHAN2_Ride_touxiang_3_10\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t国王黄金麒麟图鉴激活：全属性+1000全攻击+1550\t1\t国王黄金麒麟图鉴激活：全属性+1000全攻击+1550\t
22381\t22381\t9\t1\tHAN2_Ride_touxiang_3_10\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t国王黄金麒麟图鉴激活：全属性+1000全攻击+1550\t1\t国王黄金麒麟图鉴激活：全属性+1000全攻击+1550\t
\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t
22382\t22382\t9\t1\tCJSH_Ma_touxiang_4_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t电光独角兽(红)图鉴激活：全攻击+500暴击+20命中+20\t1\t电光独角兽(红)图鉴激活：全攻击+500暴击+20命中+20\t
22383\t22383\t9\t1\tCJSH_Ma_touxiang_4_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t电光独角兽(红)图鉴激活：全攻击+500暴击+20命中+20\t1\t电光独角兽(红)图鉴激活：全攻击+500暴击+20命中+20\t
22384\t22384\t9\t1\tCJSH_Ma_touxiang_4_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t电光独角兽(蓝)图鉴激活：全属性+2000暴击+50命中+50\t1\t电光独角兽(蓝)图鉴激活：全属性+2000暴击+50命中+50\t
22385\t22385\t9\t1\tCJSH_Ma_touxiang_4_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t电光独角兽(蓝)图鉴激活：全属性+2000暴击+50命中+50\t1\t电光独角兽(蓝)图鉴激活：全属性+2000暴击+50命中+50\t
22386\t22386\t9\t1\tCJSH_Monster_touxiang_19_15\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t九尾雪狐图鉴激活：全属性+2000暴击+50命中+50\t1\t九尾雪狐图鉴激活：全属性+2000暴击+50命中+50\t
22387\t22387\t9\t1\tCJSH_Monster_touxiang_19_15\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t九尾雪狐图鉴激活：全属性+2000暴击+50命中+50\t1\t九尾雪狐图鉴激活：全属性+2000暴击+50命中+50\t
22388\t22388\t9\t1\tCJSH_Ma_touxiang_4_6\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t暗地金龙图鉴激活：全攻击+500暴击+20命中+20\t1\t暗地金龙图鉴激活：全攻击+500暴击+20命中+20\t
22389\t22389\t9\t1\tCJSH_Ma_touxiang_4_6\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t暗地金龙图鉴激活：全攻击+500暴击+20命中+20\t1\t暗地金龙图鉴激活：全攻击+500暴击+20命中+20\t
22390\t22390\t9\t1\tCJSH_Monster_touxiang_21_6\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你泡泡蟹图鉴激活：全属性+2000暴击+50命中+50\t1\t迷你泡泡蟹图鉴激活：全属性+2000暴击+50命中+50\t
22391\t22391\t9\t1\tCJSH_Monster_touxiang_21_6\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你泡泡蟹图鉴激活：全属性+2000暴击+50命中+50\t1\t迷你泡泡蟹图鉴激活：全属性+2000暴击+50命中+50\t
22392\t22392\t9\t1\tHAN2_Pet_touxiang_1_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t比翼神鸟图鉴激活：全攻击+500暴击+20命中+20\t1\t比翼神鸟图鉴激活：全攻击+500暴击+20命中+20\t
22393\t22393\t9\t1\tHAN2_Pet_touxiang_1_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t比翼神鸟图鉴激活：全攻击+500暴击+20命中+20\t1\t比翼神鸟图鉴激活：全攻击+500暴击+20命中+20\t
22394\t22394\t9\t1\tHAN2_Ride_touxiang_8_5\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t祥瑞神鸟图鉴激活：全攻击+500暴击+20命中+20\t1\t祥瑞神鸟图鉴激活：全攻击+500暴击+20命中+20\t
22395\t22395\t9\t1\tHAN2_Ride_touxiang_8_5\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t祥瑞神鸟图鉴激活：全攻击+500暴击+20命中+20\t1\t祥瑞神鸟图鉴激活：全攻击+500暴击+20命中+20\t
22396\t22396\t9\t1\tHAN2_Ride_touxiang_9_9\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t皇帝坐骑图鉴激活：全属性+2000暴击+50命中+50\t1\t皇帝坐骑图鉴激活：全属性+2000暴击+50命中+50\t
22397\t22397\t9\t1\tHAN2_Ride_touxiang_9_9\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t皇帝坐骑图鉴激活：全属性+2000暴击+50命中+50\t1\t皇帝坐骑图鉴激活：全属性+2000暴击+50命中+50\t
22398\t22398\t9\t1\tHAN2_Monster_touxiang_3_15\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你变异冰魄冥虎图鉴激活：全属性+2000暴击+50命中+50\t1\t迷你变异冰魄冥虎图鉴激活：全属性+2000暴击+50命中+50\t
22399\t22399\t9\t1\tHAN2_Monster_touxiang_3_15\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你变异冰魄冥虎图鉴激活：全属性+2000暴击+50命中+50\t1\t迷你变异冰魄冥虎图鉴激活：全属性+2000暴击+50命中+50\t
22400\t22400\t9\t1\tCJSH_Ma_touxiang_3_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t地狱猪皇图鉴激活：全攻击+500暴击+20命中+20\t1\t地狱猪皇图鉴激活：全攻击+500暴击+20命中+20\t
22401\t22401\t9\t1\tCJSH_Ma_touxiang_3_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t地狱猪皇图鉴激活：全攻击+500暴击+20命中+20\t1\t地狱猪皇图鉴激活：全攻击+500暴击+20命中+20\t
\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t
22402\t22402\t9\t1\tHAN2_Monster_touxiang_19_3\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你熊猫图鉴激活：全属性+2000暴击+50命中+50\t1\t迷你熊猫图鉴激活：全属性+2000暴击+50命中+50\t
22403\t22403\t9\t1\tHAN2_Monster_touxiang_19_3\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你熊猫图鉴激活：全属性+2000暴击+50命中+50\t1\t迷你熊猫图鉴激活：全属性+2000暴击+50命中+50\t
22404\t22404\t9\t1\tCJSH_Monster_touxiang_16_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你雷芒雨工图鉴激活：全攻击+500暴击+40命中+40\t1\t迷你雷芒雨工图鉴激活：全攻击+500暴击+40命中+40\t
22405\t22405\t9\t1\tCJSH_Monster_touxiang_16_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你雷芒雨工图鉴激活：全攻击+500暴击+40命中+40\t1\t迷你雷芒雨工图鉴激活：全攻击+500暴击+40命中+40\t
22406\t22406\t9\t1\tCJSH_Monster_touxiang_21_16\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t炽炎年兽图鉴激活：全攻击+500暴击+40命中+40\t1\t炽炎年兽图鉴激活：全攻击+500暴击+40命中+40\t
22407\t22407\t9\t1\tCJSH_Monster_touxiang_21_16\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t炽炎年兽图鉴激活：全攻击+500暴击+40命中+40\t1\t炽炎年兽图鉴激活：全攻击+500暴击+40命中+40\t
22408\t22408\t9\t1\tCJSH_Monster_touxiang_16_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t变异迷你雷芒雨工图鉴激活：全属性+2000暴击+50命中+50\t1\t变异迷你雷芒雨工图鉴激活：全属性+2000暴击+50命中+50\t
22409\t22409\t9\t1\tCJSH_Monster_touxiang_16_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t变异迷你雷芒雨工图鉴激活：全属性+2000暴击+50命中+50\t1\t变异迷你雷芒雨工图鉴激活：全属性+2000暴击+50命中+50\t
22410\t22410\t9\t1\tCJSH_Ma_touxiang_3_16\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t圣诞雪猿图鉴激活：全攻击+500暴击+40命中+40\t1\t圣诞雪猿图鉴激活：全攻击+500暴击+40命中+40\t
22411\t22411\t9\t1\tCJSH_Ma_touxiang_3_16\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t圣诞雪猿图鉴激活：全攻击+500暴击+40命中+40\t1\t圣诞雪猿图鉴激活：全攻击+500暴击+40命中+40\t
22412\t22412\t9\t1\tCJSH_Monster_touxiang_19_12\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t熔岩地狱犬图鉴激活：全属性+2000暴击+50命中+50\t1\t熔岩地狱犬图鉴激活：全属性+2000暴击+50命中+50\t
22413\t22413\t9\t1\tCJSH_Monster_touxiang_19_12\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t熔岩地狱犬图鉴激活：全属性+2000暴击+50命中+50\t1\t熔岩地狱犬图鉴激活：全属性+2000暴击+50命中+50\t
22414\t22414\t9\t1\tCJSH_Monster_touxiang_19_14\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你赤炎火鸟(黄)图鉴激活：全攻击+500暴击+40命中+40\t1\t迷你赤炎火鸟(黄)图鉴激活：全攻击+500暴击+40命中+40\t
22415\t22415\t9\t1\tCJSH_Monster_touxiang_19_14\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你赤炎火鸟(黄)图鉴激活：全攻击+500暴击+40命中+40\t1\t迷你赤炎火鸟(黄)图鉴激活：全攻击+500暴击+40命中+40\t
22416\t22416\t9\t1\tCJSH_Monster_touxiang_19_14\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你赤炎火鸟(蓝)图鉴激活：全属性+2000暴击+50命中+50\t1\t迷你赤炎火鸟(蓝)图鉴激活：全属性+2000暴击+50命中+50\t
22417\t22417\t9\t1\tCJSH_Monster_touxiang_19_14\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你赤炎火鸟(蓝)图鉴激活：全属性+2000暴击+50命中+50\t1\t迷你赤炎火鸟(蓝)图鉴激活：全属性+2000暴击+50命中+50\t
22418\t22418\t9\t1\tCJSH_Monster_touxiang_17_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你玉兔图鉴激活：全攻击+500暴击+40命中+40\t1\t迷你玉兔图鉴激活：全攻击+500暴击+40命中+40\t
22419\t22419\t9\t1\tCJSH_Monster_touxiang_17_2\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你玉兔图鉴激活：全攻击+500暴击+40命中+40\t1\t迷你玉兔图鉴激活：全攻击+500暴击+40命中+40\t
22420\t22420\t9\t1\tCJSH_Monster_touxiang_20_1\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t天命猫妖图鉴激活：全属性+2000暴击+50命中+50\t1\t天命猫妖图鉴激活：全属性+2000暴击+50命中+50\t
22421\t22421\t9\t1\tCJSH_Monster_touxiang_20_1\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t天命猫妖图鉴激活：全属性+2000暴击+50命中+50\t1\t天命猫妖图鉴激活：全属性+2000暴击+50命中+50\t
\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t
22422\t22422\t9\t1\tCJSH_Monster_touxiang_21_1\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t七彩凤凰图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t七彩凤凰图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22423\t22423\t9\t1\tCJSH_Monster_touxiang_21_1\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t七彩凤凰图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t七彩凤凰图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22424\t22424\t9\t1\tCJSH_Monster_touxiang_21_8\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t银焰独角兽图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t银焰独角兽图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22425\t22425\t9\t1\tCJSH_Monster_touxiang_21_8\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t银焰独角兽图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t银焰独角兽图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22426\t22426\t9\t1\tCJSH_Monster_touxiang_21_7\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t巨型幽纹梦魇图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t巨型幽纹梦魇图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22427\t22427\t9\t1\tCJSH_Monster_touxiang_21_7\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t巨型幽纹梦魇图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t巨型幽纹梦魇图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22428\t22428\t9\t1\tCJSH_Monster_touxiang_21_7\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t幽纹梦魇图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t幽纹梦魇图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22429\t22429\t9\t1\tCJSH_Monster_touxiang_21_7\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t幽纹梦魇图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t幽纹梦魇图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22430\t22430\t9\t1\tCJSH_Monster_touxiang_19_13\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t塔布羊图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t塔布羊图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22431\t22431\t9\t1\tCJSH_Monster_touxiang_19_13\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t塔布羊图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t塔布羊图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22432\t22432\t9\t1\tCJSH_Monster_touxiang_19_13\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你塔布羊图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t迷你塔布羊图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22433\t22433\t9\t1\tCJSH_Monster_touxiang_19_13\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你塔布羊图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t迷你塔布羊图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22434\t22434\t9\t1\tCJSH_Monster_touxiang_21_8\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你独角兽(黄)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t迷你独角兽(黄)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22435\t22435\t9\t1\tCJSH_Monster_touxiang_21_8\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你独角兽(黄)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t迷你独角兽(黄)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22436\t22436\t9\t1\tCJSH_Monster_touxiang_21_8\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你独角兽(蓝)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t迷你独角兽(蓝)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22437\t22437\t9\t1\tCJSH_Monster_touxiang_21_8\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你独角兽(蓝)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t迷你独角兽(蓝)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22438\t22438\t9\t1\tHAN2_Ride_touxiang_3_10\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你黄金麒麟(黄)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t迷你黄金麒麟(黄)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22439\t22439\t9\t1\tHAN2_Ride_touxiang_3_10\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你黄金麒麟(黄)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t迷你黄金麒麟(黄)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22440\t22440\t9\t1\tHAN2_Ride_touxiang_3_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你黄金麒麟(蓝)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t迷你黄金麒麟(蓝)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
22441\t22441\t9\t1\tHAN2_Ride_touxiang_3_11\t\t\t人物身体前置点\t\t\t人物身体受击点\t1\t0\t0\t0\t\t\t\t\t\t迷你黄金麒麟(蓝)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t1\t迷你黄金麒麟(蓝)图鉴激活：全攻击+2100全防御+2500暴击、韧性、命中、闪避+80,爆伤+100\t
`


let arr = [];
str.split('\n').forEach(line => {
    let obj = line.split('\t')
    if (obj.length > 5 && obj[0] != "") {
        arr.push(obj)
    }
})

let res = ``;
let index = 1;
let buffID = 6780;
let count = 91
if (arr.length !== count * 2) {
    throw new Error("数量不对")
}
for (let i = 0; i < count; i++) {
    let v = (i+1)*13
    let item1 = arr[i*2]
    let item2 = arr[i*2+1]

    let b = item1[20].split('图鉴激活')[0].trim() + `坐骑激活：全属性+${v}`;
    item1[20] = b;
    item1[22] = b;
    item2[20] = b;
    item2[22] = b;
    res += item1.join('\t') + '\n' + item2.join('\t') + '\n';
}
console.log(res)

// 如果想保存结果到文件，请取消注释以下行：
fs.writeFileSync('gen_up_buff_desc.txt', res, 'utf8');
