const fs = require("fs")

let str = `182\t2\t#B\t0\t#49\t#49\t肝帝的象征！\t0\t升级称号获得！\t4400\t\t255\t3
183\t2\t#B\t0\t#50\t#50\t肝帝的象征！\t0\t升级称号获得！\t4401\t\t255\t3
184\t2\t#B\t0\t#51\t#51\t肝帝的象征！\t0\t升级称号获得！\t4402\t\t255\t3
185\t2\t#B\t0\t#52\t#52\t肝帝的象征！\t0\t升级称号获得！\t4403\t\t255\t3
186\t2\t#B\t0\t#53\t#53\t肝帝的象征！\t0\t升级称号获得！\t4404\t\t255\t3
187\t2\t#B\t0\t#54\t#54\t肝帝的象征！\t0\t升级称号获得！\t4405\t\t255\t3
188\t2\t#B\t0\t#55\t#55\t肝帝的象征！\t0\t升级称号获得！\t4406\t\t255\t3
189\t2\t#B\t0\t#56\t#56\t肝帝的象征！\t0\t升级称号获得！\t4407\t\t255\t3
190\t2\t#B\t0\t#57\t#57\t肝帝的象征！\t0\t升级称号获得！\t4408\t\t255\t3
191\t2\t#B\t0\t#58\t#58\t肝帝的象征！\t0\t升级称号获得！\t4409\t\t255\t3
192\t2\t#B\t0\t#59\t#59\t肝帝的象征！\t0\t升级称号获得！\t4410\t\t255\t3
193\t2\t#B\t0\t#60\t#60\t肝帝的象征！\t0\t升级称号获得！\t4411\t\t255\t3
194\t2\t#B\t0\t#61\t#61\t肝帝的象征！\t0\t升级称号获得！\t4412\t\t255\t3
195\t2\t#B\t0\t#62\t#62\t肝帝的象征！\t0\t升级称号获得！\t4413\t\t255\t3
196\t2\t#B\t0\t#63\t#63\t肝帝的象征！\t0\t升级称号获得！\t4414\t\t255\t3
197\t2\t#B\t0\t#64\t#64\t肝帝的象征！\t0\t升级称号获得！\t4415\t\t255\t3
198\t2\t#B\t0\t#65\t#65\t肝帝的象征！\t0\t升级称号获得！\t4416\t\t255\t3
199\t2\t#B\t0\t#66\t#66\t肝帝的象征！\t0\t升级称号获得！\t4417\t\t255\t3
200\t2\t#B\t0\t#67\t#67\t肝帝的象征！\t0\t升级称号获得！\t4418\t\t255\t3
201\t2\t#B\t0\t#68\t#68\t肝帝的象征！\t0\t升级称号获得！\t4419\t\t255\t3
202\t2\t#B\t0\t#69\t#69\t肝帝的象征！\t0\t升级称号获得！\t4420\t\t255\t3
203\t2\t#B\t0\t#70\t#70\t肝帝的象征！\t0\t升级称号获得！\t4421\t\t255\t3
204\t2\t#B\t0\t#71\t#71\t肝帝的象征！\t0\t升级称号获得！\t4422\t\t255\t3
205\t2\t#B\t0\t#72\t#72\t肝帝的象征！\t0\t升级称号获得！\t4423\t\t255\t3
206\t2\t#B\t0\t#73\t#73\t肝帝的象征！\t0\t升级称号获得！\t4424\t\t255\t3
207\t2\t#B\t0\t#74\t#74\t肝帝的象征！\t0\t升级称号获得！\t4425\t\t255\t3
208\t2\t#B\t0\t#75\t#75\t肝帝的象征！\t0\t升级称号获得！\t4426\t\t255\t3
209\t2\t#B\t0\t#76\t#76\t肝帝的象征！\t0\t升级称号获得！\t4427\t\t255\t3
210\t2\t#B\t0\t#79\t#79\t肝帝的象征！\t0\t升级称号获得！\t4428\t\t255\t3
211\t2\t#B\t0\t#80\t#80\t肝帝的象征！\t0\t升级称号获得！\t4429\t\t255\t3
212\t2\t#B\t0\t#81\t#81\t肝帝的象征！\t0\t升级称号获得！\t4430\t\t255\t3
213\t2\t#B\t0\t#82\t#82\t肝帝的象征！\t0\t升级称号获得！\t4431\t\t255\t3
214\t2\t#B\t0\t#83\t#83\t肝帝的象征！\t0\t升级称号获得！\t4432\t\t255\t3
215\t2\t#B\t0\t#84\t#84\t肝帝的象征！\t0\t升级称号获得！\t4433\t\t255\t3
216\t2\t#B\t0\t#85\t#85\t肝帝的象征！\t0\t升级称号获得！\t4434\t\t255\t3
217\t2\t#B\t0\t#86\t#86\t肝帝的象征！\t0\t升级称号获得！\t4435\t\t255\t3
218\t2\t#B\t0\t#87\t#87\t肝帝的象征！\t0\t升级称号获得！\t4436\t\t255\t3
219\t2\t#B\t0\t#88\t#88\t肝帝的象征！\t0\t升级称号获得！\t4437\t\t255\t3
220\t2\t#B\t0\t#89\t#89\t肝帝的象征！\t0\t升级称号获得！\t4438\t\t255\t3
221\t2\t#B\t0\t#90\t#90\t肝帝的象征！\t0\t升级称号获得！\t4439\t\t255\t3
222\t2\t#B\t0\t#91\t#91\t肝帝的象征！\t0\t升级称号获得！\t4440\t\t255\t3
223\t2\t#B\t0\t#92\t#92\t肝帝的象征！\t0\t升级称号获得！\t4441\t\t255\t3
224\t2\t#B\t0\t#93\t#93\t肝帝的象征！\t0\t升级称号获得！\t4442\t\t255\t3
225\t2\t#B\t0\t#94\t#94\t肝帝的象征！\t0\t升级称号获得！\t4443\t\t255\t3
226\t2\t#B\t0\t#59\t#59\t肝帝的象征！\t0\t升级称号获得！\t4444\t\t255\t3
227\t2\t#B\t0\t#60\t#60\t肝帝的象征！\t0\t升级称号获得！\t4445\t\t255\t3
228\t2\t#B\t0\t#61\t#61\t肝帝的象征！\t0\t升级称号获得！\t4446\t\t255\t3
229\t2\t#B\t0\t#62\t#62\t肝帝的象征！\t0\t升级称号获得！\t4447\t\t255\t3
230\t2\t#B\t0\t#63\t#63\t肝帝的象征！\t0\t升级称号获得！\t4448\t\t255\t3
231\t2\t#B\t0\t#64\t#64\t肝帝的象征！\t0\t升级称号获得！\t4449\t\t255\t3
232\t2\t#B\t0\t#65\t#65\t肝帝的象征！\t0\t升级称号获得！\t4450\t\t255\t3
233\t2\t#B\t0\t#66\t#66\t肝帝的象征！\t0\t升级称号获得！\t4451\t\t255\t3
234\t2\t#B\t0\t#67\t#67\t肝帝的象征！\t0\t升级称号获得！\t4452\t\t255\t3
235\t2\t#B\t0\t#68\t#68\t肝帝的象征！\t0\t升级称号获得！\t4453\t\t255\t3
236\t2\t#B\t0\t#69\t#69\t肝帝的象征！\t0\t升级称号获得！\t4454\t\t255\t3
237\t2\t#B\t0\t#70\t#70\t肝帝的象征！\t0\t升级称号获得！\t4455\t\t255\t3
`


let titles = []
let luastr = ``;
let bufflogistr = ``
let arr = str.split("\n")
let buffid = 4400
let index = 1
arr.forEach(row=>{
    let elems = row.split("\t");
    if (elems.length <= 5) {
        return
    }
    let id = elems[0]
    let name = elems[4]
    let buffid = elems[9]
    let buffname = `命中闪避暴击韧性暴伤+${index}`
    luastr += `{varId = ${id}, varName = "${name}", neednum =100,needid=11000339,buffdesc="${buffname}"},\n`

    bufflogistr += `${buffid}	${buffname}	命中修正值	${index}	闪避修正值	${index}	会心修正值	${index}	韧性修正值	${index}	暴击伤害修正值	${index}																								13	STD_IMPACT_042	1	${buffid}	${buffid}	${buffid}	1	1	0	0	0	0	0	0	0	1	-1	0	0	0	-1	0	0				-1\n`
    buffid++
    index++
})

fs.writeFileSync('gen_buff_lua.txt', luastr, 'utf8');
fs.writeFileSync('gen_buff_logic.txt', bufflogistr, 'utf8');


